In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('../Data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [6]:
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [8]:
#p28 parse_cols은 deprecated -> usecols로 변경 
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', header=2, usecols = 'B,D,G,J,N', encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [9]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별'
                         ,pop_Seoul.columns[1]:'인구수'
                         ,pop_Seoul.columns[2]:'한국인'
                         ,pop_Seoul.columns[3]:'외국인'
                         ,pop_Seoul.columns[4]:'고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [12]:
#1-3 pandas 기초 익히기
import pandas as pd
import numpy as np

In [13]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [14]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-04 -1.217315 -0.143152  1.141487  0.628192
2013-01-05 -0.670945 -0.091365  0.721594  0.860128
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [16]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[-0.70569362, -0.23752393,  0.22102905, -0.95615875],
       [ 1.46518028,  1.01242925, -0.21390054, -0.05494238],
       [-2.67356865, -0.99862883,  1.01799558,  0.22936041],
       [-1.21731465, -0.14315166,  1.14148653,  0.62819217],
       [-0.67094452, -0.0913647 ,  0.72159432,  0.86012806],
       [ 0.21167697, -1.26939328, -0.60618221,  0.41130369]])

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.598444 -0.287939  0.380337  0.186314
std    1.387137  0.802675  0.700590  0.642682
min   -2.673569 -1.269393 -0.606182 -0.956159
25%   -1.089409 -0.808353 -0.105168  0.016133
50%   -0.688319 -0.190338  0.471312  0.320332
75%   -0.008978 -0.104311  0.943895  0.573970
max    1.465180  1.012429  1.141487  0.860128

In [22]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-05 -0.670945 -0.091365  0.721594  0.860128
2013-01-04 -1.217315 -0.143152  1.141487  0.628192
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [23]:
df

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-04 -1.217315 -0.143152  1.141487  0.628192
2013-01-05 -0.670945 -0.091365  0.721594  0.860128
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [24]:
df['A']

2013-01-01   -0.705694
2013-01-02    1.465180
2013-01-03   -2.673569
2013-01-04   -1.217315
2013-01-05   -0.670945
2013-01-06    0.211677
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360

In [26]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-04 -1.217315 -0.143152  1.141487  0.628192

In [27]:
df[1:3]

                   A         B         C         D
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360

In [31]:
df.loc[dates[0]]

A   -0.705694
B   -0.237524
C    0.221029
D   -0.956159
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.705694 -0.237524
2013-01-02  1.465180  1.012429
2013-01-03 -2.673569 -0.998629
2013-01-04 -1.217315 -0.143152
2013-01-05 -0.670945 -0.091365
2013-01-06  0.211677 -1.269393

In [35]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.465180  1.012429
2013-01-03 -2.673569 -0.998629
2013-01-04 -1.217315 -0.143152

In [36]:
df.loc['20130102',['A','B']]

A    1.465180
B    1.012429
Name: 2013-01-02 00:00:00, dtype: float64

In [37]:
df.loc[dates[0],'A']

-0.7056936179247705

In [38]:
df.iloc[3]

A   -1.217315
B   -0.143152
C    1.141487
D    0.628192
Name: 2013-01-04 00:00:00, dtype: float64

In [43]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.217315 -0.143152
2013-01-05 -0.670945 -0.091365

In [44]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.465180 -0.213901
2013-01-03 -2.673569  1.017996
2013-01-05 -0.670945  0.721594

In [45]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360

In [46]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.237524  0.221029
2013-01-02  1.012429 -0.213901
2013-01-03 -0.998629  1.017996
2013-01-04 -0.143152  1.141487
2013-01-05 -0.091365  0.721594
2013-01-06 -1.269393 -0.606182

In [47]:
df

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-04 -1.217315 -0.143152  1.141487  0.628192
2013-01-05 -0.670945 -0.091365  0.721594  0.860128
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [48]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [50]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.221029       NaN
2013-01-02  1.465180  1.012429       NaN       NaN
2013-01-03       NaN       NaN  1.017996  0.229360
2013-01-04       NaN       NaN  1.141487  0.628192
2013-01-05       NaN       NaN  0.721594  0.860128
2013-01-06  0.211677       NaN       NaN  0.411304

In [51]:
df2 = df.copy()

In [54]:
df2['E'] = ['one', 'one', 'two', 'tree', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159    one
2013-01-02  1.465180  1.012429 -0.213901 -0.054942    one
2013-01-03 -2.673569 -0.998629  1.017996  0.229360    two
2013-01-04 -1.217315 -0.143152  1.141487  0.628192   tree
2013-01-05 -0.670945 -0.091365  0.721594  0.860128   four
2013-01-06  0.211677 -1.269393 -0.606182  0.411304  three

In [56]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [57]:
df[df2['E'].isin(['two','four'])]

                   A         B         C         D
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-05 -0.670945 -0.091365  0.721594  0.860128

In [58]:
df

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  1.465180  1.012429 -0.213901 -0.054942
2013-01-03 -2.673569 -0.998629  1.017996  0.229360
2013-01-04 -1.217315 -0.143152  1.141487  0.628192
2013-01-05 -0.670945 -0.091365  0.721594  0.860128
2013-01-06  0.211677 -1.269393 -0.606182  0.411304

In [59]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.705694 -0.237524  0.221029 -0.956159
2013-01-02  0.759487  0.774905  0.007129 -1.011101
2013-01-03 -1.914082 -0.223724  1.025124 -0.781741
2013-01-04 -3.131397 -0.366875  2.166611 -0.153549
2013-01-05 -3.802341 -0.458240  2.888205  0.706580
2013-01-06 -3.590664 -1.727633  2.282023  1.117883

In [61]:
df.apply(lambda x: x.max() - x.min())

A    4.138749
B    2.281823
C    1.747669
D    1.816287
dtype: float64